// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
#nullable disable
// Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.Задача 47

// Console.WriteLine("Задайте число строк m= ");
// bool isNumberm = int.TryParse(Console.ReadLine(), out int m);
// if (!isNumberm || m <= 1)
// {
//     Console.WriteLine("Неверный ввод");
//     return;
// }
// Console.WriteLine("Задайте число столбцов n= ");
// bool isNumbern = int.TryParse(Console.ReadLine(), out int n);
// if (!isNumbern || n <= 1)
// {
//     Console.WriteLine("Неверный ввод");//задали размер проверили на число
//     return;
// }
// double[,] mn = new double[m, n];
// void CreateRandomDoubleArray(int m, int n)
// {
//     Random random = new Random();
//     for (int i = 0; i < mn.GetLength(0); i++)
//     {
//         for (int j = 0; j < mn.GetLength(1); j++)
//         {
//             mn[i, j] = Convert.ToDouble(random.Next(100));
//         }
//     }
// }
// void Print2DDoubleArray(double[,] array)
// {
//     for (int i = 0; i < array.GetLength(0); i++)
//     {
//         for (int j = 0; j < array.GetLength(1); j++)
//         {
//             Console.Write($" {array[i, j]}");
//         }
//         Console.WriteLine();
//     }
// }
// CreateRandomDoubleArray(m, n);
// Print2DDoubleArray(mn);
//
//
// Задача 50. Напишите программу, которая на вход принимает число и ищет в двумерном массиве, Задача 50. 
//и возвращает индексы этого элемента или же указание, что такого элемента нет.
//
//

//
//
//
// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
//
//
//


