// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 29: Напишите программу, которая задаёт массив из 8 элементов 
// и выводит их на экран.


// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.

// Задача 27: Напишите программу, которая принимает на вход число
//  и выдаёт сумму цифр в числе.

