// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Условие: Написать программу, которая из имеющегося массива строк формирует массив из строк, 
// длина которых меньше, либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, 
// либо задать на старте выполнения алгоитма. 
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
#nullable disable
